alefragnani.bookmarks
anthropic.claude-code
anysphere.cursorpyright
anysphere.pyright
be5invis.vscode-custom-css
dbaeumer.vscode-eslint
dline.cobaltnext
eamodio.gitlens
esbenp.prettier-vscode
mohsen1.prettify-json
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.makefile-tools
ms-vsliveshare.vsliveshare
pkief.material-icon-theme
ritwickdey.liveserver
shd101wyy.markdown-preview-enhanced
sonarsource.sonarlint-vscode
wesbos.theme-cobalt2
